{"pages":[{"title":"About me","text":"some private notes Use maven to contain another project, finally get one jar Section Title This block quote is here for your information.","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/04/02/hello-world/"},{"title":"jbpm_kjar_deployment_descriptor","text":"Questiondeployment descriptorwhich should be used, kie-deployment-descriptor.xml or kie-wb-deployment-descriptor.xml? project level kie-deployment-descriptor.xml; application level kie-wb-deployment-descriptor.xml. application level is for all projects. In my point of view, project level is kjar, application level is war or ear. The deployment descriptor allow you to define descriptors to each deployment items to get fine grained control. Generally, the file is called kie-deployment-descriptor.xml and you should place this file next to your kmodule.xml file in the META-INF folder. You can change this default location (and the filename) by specifying it as a system parameter:1-Dorg.kie.deployment.desc.location=file:/path/to/file/company-deployment-descriptor.xml These descriptors allow you to configure the execution server on multiple levels (server level default, different deployment descriptor per kjar and so on). Deployment descriptors allow the user to configure the execution server on multiple levels: server level: the main level and the one that applies to all kjars deployed on the server. kjar level: this allows you to configure descriptors on a per kjar basis. deploy time level: descriptors that apply while a kjar is being deployed. The hierarchy works like this: deploy time configuration &gt; kjar configuration &gt; server configuration noteworthy articlehttps://access.redhat.com/documentation/en-us/red_hat_jboss_bpm_suite/6.1/html/administration_and_configuration_guide/sect-deployment_descriptors some articleshttp://mswiderski.blogspot.com/2014/ Overview of jBPMhttp://mswiderski.blogspot.com/2014/12/keep-your-jbpm-environment-healthy.html http://mswiderski.blogspot.com/2014/11/cross-framework-services-in-jbpm-62.html jbpm integration with Springhttp://mswiderski.blogspot.com/2014/01/jbpm-6-with-spring.html","link":"/2019/05/11/jbpm-kjar-deployment-descriptor/"}],"tags":[{"name":"jbpm","slug":"jbpm","link":"/tags/jbpm/"},{"name":"kjar","slug":"kjar","link":"/tags/kjar/"}],"categories":[{"name":"blog","slug":"blog","link":"/categories/blog/"},{"name":"jbpm","slug":"blog/jbpm","link":"/categories/blog/jbpm/"}]}